/*:
 ## Упражнение - логические операторы

 Для каждого из логических выражений ниже, напечатайте значение, которое, как вы думаете, оно примет (`true` или `false`).  Затем вставьте в инструкцию print это логическое выражение, чтобы увидеть, были ли вы правы.  Действуйте по примеру ниже.
 
    43 == 53
    print(false)
    print(43 == 53)

 
 1. `9 == 9`
 */
print(true)
print(9 == 9)
/*:
 2. `9 != 9`
 */
print(false)
print(9 != 9)
/*: 
 3. `47 > 90`
 */
print(false)
print(47 > 90)
/*:
 4. `47 < 90`
 */
print(true)
print(47 < 90)
/*:
 5. `4 <= 4`
 */
print(true)
print(4 <= 4)
/*:
 6. `4 >= 5`
 */
print(false)
print(4 >= 5)
/*:
 7. `(47 > 90) && (47 < 90)`
 */
print(false)
print((47 > 90) && (47 < 90))

/*:
 8. `(47 > 90) || (47 < 90)`
 */
print(true)
print((47 > 90) || ((47 < 90)))
/*:
 9. `!true`
 */
print(false)
print(!true)
//: страница 1 из 9  |  [Далее: Упражнение - инструкции if и if-else](@next)
