/*:
 ## Упражнения - циклы For-In
 
 Создайте цикл for-in, выводящий в консоль числа от 1 до 100.
 */


/*:
 Создайте цикл for-in, проходящий по всем символам в строке `alphabet`.  Выведите в консоль каждый символ, а также его индекс в строке.
 */
let alphabet = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"


/*:
 Создайте словарь типа `[String: String]`, где ключами будут названия стран, а значениями — названия их столиц.  Включите в коллекцию, как минимум, три пары ключ/значение.  Затем примените цикл for-in, чтобы пройти по парам и вывести в консоль ключи и значения словаря.
 */


//: страница 1 из 6  |  [Далее: Упражнение для приложения - виды спорта](@next)
