/*:
 ## Упражнение 9 - выведение типа и требуемые значения
 
 Объявите переменную с именем `name` типа `String`, но не присваивайте ей значение.  Напечатайте `name` в консоль.  Компилируется ли код?  Закоментируйте строчку, которая не компилируется.
 */
var name: String
//print(name);
/*:
 Теперь присвойте значение переменной `name`, и выведите его в консоль.
 */
name = "Batman"
print(name);

/*:
 Объявите переменную под названием `distanceTraveled` (пройденное расстояние) и установите её равным 0.  Не задавайте тип переменной явно.
 */
var distanceTraveled: Double = 0

/*:
 Теперь присвойте значение 54.3 переменной `distanceTraveled`.  Компилируется ли код?  Вернитесь и явным образом задайте тип переменной `distanceTraveled`, чтобы код компилировался.
 */
distanceTraveled = 54.3

//: [Ранее](@previous)  |  страница 9 из 10  |  [Далее: Упражнение 10 для приложения - выполнено на X%](@next)
